/*Создайте класс Student со свойствами:
Name
  Group
Age
  CSharpScore
SqlScore
  HasPetProject
Создайте коллекцию студентов не менее чем из 8 элементов, а также две отдельные коллекции: участники хакатона и кандидаты на стажировку.
  Выведите студентов старше 20 лет с баллом по C# больше 70.
  Сформируйте новую коллекцию, содержащую имя, группу и средний балл каждого студента.
  Отсортируйте студентов по среднему баллу по убыванию, а при равенстве — по имени.
  Найдите:
количество студентов
средний возраст
максимальный балл по C#
минимальный балл по SQL
Вывести:
трёх лучших студентов по среднему баллу
студентов с 3 по 5 место после сортировки
  Сгруппировать студентов по группам и для каждой группы вывести количество студентов.
  Для двух дополнительных коллекций определить:
объединение
  пересечение
разность*/